Revit.Elements.Topography.InitTopography(System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ})
Initialize a Topography element
points:

Revit.Elements.Topography.InitTopography(Autodesk.Revit.DB.Architecture.TopographySurface)
Initialize a Topography element
topoSurface:

Revit.Elements.Topography.ByPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Create a topography surface from a list of points.
points: The points which define the topography surface.
Returns: A topography surface through the specified points.

Revit.Elements.Topography.InternalTopographySurface
Internal variable containing the wrapped Revit object

Revit.Elements.Topography.Points
The set of points from which this TopographySurface is constructed.

Revit.Elements.Topography.Mesh
Get the underlying triangular Mesh from the Topography